In [172]:
import numpy as np
import pandas as pd
import sklearn
import matplotlib.pyplot as plt
import matplotlib
import seaborn as sns
%matplotlib inline

In [128]:
df = pd.read_csv('/cxldata/datasets/project/sales_historical_sales_value.csv')

In [129]:
df.head()

   ID1  ID2                    time  value
0    1    2  11/13/2010 12:00:00 AM    130
1    1    2  11/20/2010 12:00:00 AM    222
2    1    2  11/27/2010 12:00:00 AM    166
3    1    2   12/4/2010 12:00:00 AM    174
4    1    2  12/11/2010 12:00:00 AM    236

In [130]:
df1 = pd.read_csv('/cxldata/datasets/project/sales_disposable_personal_income.csv')

In [131]:
df1.head()

                     time    value
0   11/7/2009 12:00:00 AM  10886.9
1  11/14/2009 12:00:00 AM  10886.9
2  11/21/2009 12:00:00 AM  10886.9
3  11/28/2009 12:00:00 AM  10886.9
4   12/5/2009 12:00:00 AM  10924.7

In [132]:
merge_fsdata = pd.merge(df,df1, how = 'inner', on = 'time')
merge_fsdata.dropna(axis =1)
merge_fsdata

      ID1  ID2                    time  value_x  value_y
0       1    2  11/13/2010 12:00:00 AM      130  11160.8
1       2    1  11/13/2010 12:00:00 AM      142  11160.8
2       3    1  11/13/2010 12:00:00 AM       70  11160.8
3       4    2  11/13/2010 12:00:00 AM      314  11160.8
4       5    1  11/13/2010 12:00:00 AM      108  11160.8
...   ...  ...                     ...      ...      ...
2454   11    1   11/6/2010 12:00:00 AM      122  11160.8
2455   12    1   11/6/2010 12:00:00 AM     1270  11160.8
2456   13    1   11/6/2010 12:00:00 AM      958  11160.8
2457   14    1   11/6/2010 12:00:00 AM      412  11160.8
2458   15    1   11/6/2010 12:00:00 AM      124  11160.8

[2459 rows x 5 columns]

In [133]:
merge_data = merge_fsdata[merge_fsdata['value_x']>20]

In [134]:
merge_data.head()

   ID1  ID2                    time  value_x  value_y
0    1    2  11/13/2010 12:00:00 AM      130  11160.8
1    2    1  11/13/2010 12:00:00 AM      142  11160.8
2    3    1  11/13/2010 12:00:00 AM       70  11160.8
3    4    2  11/13/2010 12:00:00 AM      314  11160.8
4    5    1  11/13/2010 12:00:00 AM      108  11160.8

In [135]:
merge_data['Date'] = pd.DatetimeIndex(merge_data['time']).date
merge_data['year'] = pd.DatetimeIndex(merge_data['time']).year
merge_data['month'] = pd.DatetimeIndex(merge_data['time']).month
merge_data['dayofweek'] = pd.DatetimeIndex(merge_data['time']).dayofweek
merge_data['week'] = pd.DatetimeIndex(merge_data['time']).week

In [136]:
merge_data.head()

,ID1,ID2,time,value_x,value_y,Date,year,month,dayofweek,week
0,1,2,11/13/2010 12:00:00 AM,130,11160.8,2010-11-13,2010,11,5,45
1,2,1,11/13/2010 12:00:00 AM,142,11160.8,2010-11-13,2010,11,5,45
2,3,1,11/13/2010 12:00:00 AM,70,11160.8,2010-11-13,2010,11,5,45
3,4,2,11/13/2010 12:00:00 AM,314,11160.8,2010-11-13,2010,11,5,45
4,5,1,11/13/2010 12:00:00 AM,108,11160.8,2010-11-13,2010,11,5,45

In [137]:
merge_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2459 entries, 0 to 2458
Data columns (total 10 columns):
ID1          2459 non-null int64
ID2          2459 non-null int64
time         2459 non-null object
value_x      2459 non-null int64
value_y      2459 non-null float64
Date         2459 non-null object
year         2459 non-null int64
month        2459 non-null int64
dayofweek    2459 non-null int64
week         2459 non-null int64
dtypes: float64(1), int64(7), object(2)
memory usage: 211.3+ KB

In [138]:
from sklearn.preprocessing import StandardScaler

In [139]:
columnsToScale = ['value_x','value_y']
scaler = StandardScaler()
merge_data[columnsToScale] = scaler.fit_transform(merge_data[columnsToScale])
merge_data[columnsToScale].describe()

            value_x       value_y
count  2.459000e+03  2.459000e+03
mean   5.499193e-17 -6.781255e-15
std    1.000203e+00  1.000203e+00
min   -1.037732e+00 -1.790824e+00
25%   -6.959294e-01 -9.800877e-01
50%   -3.427337e-01  2.307710e-01
75%    3.209326e-01  6.165862e-01
max    5.473603e+00  3.232404e+00

In [167]:
merge_data.head()

,ID1,ID2,time,value_x,value_y,Date,year,month,dayofweek,week
0,1,2,11/13/2010 12:00:00 AM,-0.747200,-1.790824,2010-11-13,2010,11,5,45
1,2,1,11/13/2010 12:00:00 AM,-0.713020,-1.790824,2010-11-13,2010,11,5,45
2,3,1,11/13/2010 12:00:00 AM,-0.918101,-1.790824,2010-11-13,2010,11,5,45
3,4,2,11/13/2010 12:00:00 AM,-0.223103,-1.790824,2010-11-13,2010,11,5,45
4,5,1,11/13/2010 12:00:00 AM,-0.809864,-1.790824,2010-11-13,2010,11,5,45

In [141]:
def split(data, test_size): 
    shuffled_index=np.random.permutation(len(data)) #do shuffling of the rows. 
    test_set_size=int(len(df)*test_size) #test size 20% 
    test_index=shuffled_index[:test_set_size]
    train_index=shuffled_index[test_set_size:]
    return ( data.iloc[train_index], data.iloc[test_index] )

In [164]:
from sklearn.model_selection import train_test_split
train_set,test_set = split(merge_data,test_size =0.2)

In [143]:
X_train = train_set.drop(['time','Date'], axis=1)
y_train = train_set['value_x']

In [144]:
X_test = test_set.drop(['time','Date'], axis=1)
y_test = test_set['value_x']

In [145]:
#X_testset = test_set.loc[:,X_test]
#y_testset = test_set.loc[:,y_test]

In [146]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import cross_val_predict

In [147]:
lin_reg = LinearRegression()

In [148]:
lin_reg.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [149]:
from sklearn.metrics import confusion_matrix, classification_report

In [150]:
prediction = lin_reg.predict(X_test)

In [151]:
from sklearn import metrics

In [152]:
print(np.sqrt(metrics.mean_squared_error(y_test,prediction)))

3.636495300115239e-15

In [153]:
lr_mse_scores = np.sqrt(-cross_val_score(lin_reg,X_train,y_train,cv=10,scoring ="neg_mean_squared_error"))

In [165]:
lr_mse_scores.mean()

3.60312999501903e-15

In [155]:
lr_mse_scores.std()

2.463537824210456e-15

In [156]:
from sklearn.tree import DecisionTreeRegressor

In [157]:
dec_reg = DecisionTreeRegressor(random_state = 42)

In [158]:
dec_reg.fit(X_train,y_train)

DecisionTreeRegressor(ccp_alpha=0.0, criterion='mse', max_depth=None,
                      max_features=None, max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, presort='deprecated',
                      random_state=42, splitter='best')

In [159]:
pred =dec_reg.predict(X_test)

In [160]:
y_train_pred = dec_reg.predict(X_train)

In [161]:
dt_mse_scores = np.sqrt(-cross_val_score(dec_reg,X_train,y_train,cv=10,scoring ="neg_mean_squared_error"))

In [162]:
dt_mse_scores.mean()

0.01105561135308584

In [163]:
dt_mse_scores.std()

0.00646953500738526